; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v6 - type_2 ?v4 - type_1)
 	      (pred_3 ?v5 - object ?v4 - type_1)
	      (pred_1 ?v6 - type_2 ?v7 - type_3)
	      (pred_2 ?v6 - type_2 ?v5 - object ?v7 - type_3))

   (:action op_2
       :parameters  (?v6 - type_2 ?v8 ?v1 - type_1)
       :precondition (and  (pred_4 ?v6 ?v8))
       :effect (and  (pred_4 ?v6 ?v1)
		     (not (pred_4 ?v6 ?v8))))

   (:action op_1
       :parameters (?v6 - type_2 ?v2 - object ?v3 - type_1 ?v7 - type_3)
       :precondition  (and  (pred_3 ?v2 ?v3) (pred_4 ?v6 ?v3) (pred_1 ?v6 ?v7))
       :effect (and (pred_2 ?v6 ?v2 ?v7)
		    (not (pred_3 ?v2 ?v3)) 
		    (not (pred_1 ?v6 ?v7))))

   (:action op_3
       :parameters (?v6 - type_2 ?v2 - object ?v3 - type_1 ?v7 - type_3)
       :precondition  (and  (pred_2 ?v6 ?v2 ?v7) (pred_4 ?v6 ?v3))
       :effect (and (pred_3 ?v2 ?v3)
		    (pred_1 ?v6 ?v7)
		    (not (pred_2 ?v6 ?v2 ?v7)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_11 obj_01 - type_2
obj_12 obj_07 obj_02 obj_10 - type_3
obj_06 obj_05 obj_03 obj_14 - type_1
obj_04 obj_13 obj_08 obj_09 - object)
(:init
(pred_4 obj_11 obj_03)
(pred_1 obj_11 obj_12)
(pred_1 obj_11 obj_07)
(pred_4 obj_01 obj_05)
(pred_1 obj_01 obj_02)
(pred_1 obj_01 obj_10)
(pred_3 obj_04 obj_03)
(pred_3 obj_13 obj_05)
(pred_3 obj_08 obj_06)
(pred_3 obj_09 obj_05)
)
(:goal
(and
(pred_3 obj_04 obj_14)
(pred_3 obj_13 obj_06)
(pred_3 obj_08 obj_14)
(pred_3 obj_09 obj_05)
)
)

(:constraints
  (always (not (pred_4 obj_11 obj_14)))
)
)

; plan
1. (op_1 obj_11 obj_04 obj_03 obj_07)
   deleted: (pred_3 obj_04 obj_03) (pred_1 obj_11 obj_07)
   added: (pred_2 obj_11 obj_04 obj_07)
   goals met: 1 of 4
2. (op_1 obj_01 obj_13 obj_05 obj_10)
   deleted: (pred_3 obj_13 obj_05) (pred_1 obj_01 obj_10)
   added: (pred_2 obj_01 obj_13 obj_10)
   goals met: 1 of 4
3. (op_2 obj_01 obj_05 obj_06)
   deleted: (pred_4 obj_01 obj_05)
   added: (pred_4 obj_01 obj_06)
   goals met: 1 of 4
4. (op_2 obj_11 obj_03 obj_06)
   deleted: (pred_4 obj_11 obj_03)
   added: (pred_4 obj_11 obj_06)
   goals met: 1 of 4
5. (op_3 obj_01 obj_13 obj_06 obj_10)
   deleted: (pred_2 obj_01 obj_13 obj_10)
   added: (pred_3 obj_13 obj_06) (pred_1 obj_01 obj_10)
   goals met: 2 of 4
6. (op_3 obj_11 obj_04 obj_06 obj_07)
   deleted: (pred_2 obj_11 obj_04 obj_07)
   added: (pred_3 obj_04 obj_06) (pred_1 obj_11 obj_07)
   goals met: 2 of 4
7. (op_1 obj_01 obj_08 obj_06 obj_10)
   deleted: (pred_3 obj_08 obj_06) (pred_1 obj_01 obj_10)
   added: (pred_2 obj_01 obj_08 obj_10)
   goals met: 2 of 4
8. (op_2 obj_01 obj_06 obj_14)
   deleted: (pred_4 obj_01 obj_06)
   added: (pred_4 obj_01 obj_14)
   goals met: 2 of 4
9. (op_3 obj_01 obj_08 obj_14 obj_10)
   deleted: (pred_2 obj_01 obj_08 obj_10)
   added: (pred_3 obj_08 obj_14) (pred_1 obj_01 obj_10)
   goals met: 3 of 4
10. (op_2 obj_01 obj_14 obj_06)
   deleted: (pred_4 obj_01 obj_14)
   added: (pred_4 obj_01 obj_06)
   goals met: 3 of 4
11. (op_1 obj_01 obj_04 obj_06 obj_10)
   deleted: (pred_3 obj_04 obj_06) (pred_1 obj_01 obj_10)
   added: (pred_2 obj_01 obj_04 obj_10)
   goals met: 3 of 4
12. (op_2 obj_01 obj_06 obj_14)
   deleted: (pred_4 obj_01 obj_06)
   added: (pred_4 obj_01 obj_14)
   goals met: 3 of 4
13. (op_3 obj_01 obj_04 obj_14 obj_10)
   deleted: (pred_2 obj_01 obj_04 obj_10)
   added: (pred_3 obj_04 obj_14) (pred_1 obj_01 obj_10)
   goals met: 4 of 4
